# -----------------------------------
# Завдання 1. 
# Напишіть функцію calculate_area, яка приймає два аргументи: 
# length і width, і повертає площу прямокутника. Викличте цю 
# функцію з різними значеннями та виведіть результати.
# Функція calculate_area має приймати два позиційних аргументи: 
# length і width, і повертає їх добуток, що є площею прямокутника. 
# Ми викликаємо цю функцію 3 рази з різними значеннями 
# та виводимо результати на екран.


def calculate_area(length, width):
    """
    Повертає площу прямокутника.
    """
    return length * width

area1 = calculate_area(5, 3)
area2 = calculate_area(7, 2)
area3 = calculate_area(10, 4)

print(f"Площа прямокутника 1: {area1}")
print(f"Площа прямокутника 2: {area2}")
print(f"Площа прямокутника 3: {area3}")
