# Щоб створити список потрібно поставити квадратні дужки
some_list = []

# Списки використовуються для зберігання наборів елементів, 
# які можуть бути різного типу. 
# Вміст списків можна змінювати після створення.
numbers = [23, 62, 12]
mixed_list = [1, "Hello", True, 3.14]

# - цілі числа int
int_list = [1, 5, 6, 12, 561, 12]

# - дробові числа float
float_list = [2.5, 3.14, 7.89, 1.23]

# - рядки str
str_list = ["Hello", "World", "Python", "Programming"]

# - може бути порожній
empty_list = []

# - може містити в собі інші списки
big_list = [
    [1.0, 5.0, 6.0, 12.0, 534.343],
    ["Hello", "World", "Python", "Programming"],
    [True, False, True, False],
    [],
    [4, 3, 7, 43, 789],
]
print(big_list[3])
print(big_list[1][3])
