# -----------------------------------
# Завдання 1.
# Вибір активності залежно від погоди
# Залежно від погоди (сонячно, хмарно, дощ)
# виведи у консоль відповідне повідомлення:
# 'Ідеальна погода для прогулянки!',
# 'Незрозумілі погодні умови.',
# 'Краще залишитися вдома і читати книгу.',
# 'Можливо варто взяти з собою парасольку.'

weather = input("Введіть погоду (сонячно, хмарно, дощ): ")

if weather == "сонячно":
    print("Ідеальна погода для прогулянки!")
elif weather == "хмарно":
    print("Можливо варто взяти з собою парасольку.")
elif weather == "дощ":
    print("Краще залишитися вдома і читати книгу.")
else:
    print("Незрозумілі погодні умови.")
