# -----------------------------------
# Завдання 3.
# Перевіряємо, чи збігаються ім'я користувача та пароль
# з заданими значеннями. Обидві умови повинні бути
# вірними (and), щоб вивести повідомлення про успішний вхід.
# "Ви успішно ввійшли в систему."
# "Невірне ім'я користувача або пароль."

username = "admin"
password = "12345"

username_input = input("Введіть нікнейм: ")
password_input = input("Введіть пароль: ")

if username_input == username and password_input == password:
    print("Ви успішно увійшли в систему.")
else:
    print("Невірне ім'я користувача або пароль.")
