# -----------------------------------
# Завдання 4.
# Якщо особа має право керувати автомобілем
# і чи не знаходиться вона під впливом алкоголю
# чи інших речовин повертаємо True.
# Використання not інвертує значення змінної
# under_influence, тож True стає False і навпаки,
# що дозволяє правильно оцінити умову.
# Виведи одне з повідомлень:
# "Ви можете керувати автомобілем",
# "Вам заборонено керувати автомобілем!"

allowed_to_drive = True
under_influence = False

if allowed_to_drive and not under_influence:
    print("Ви можете керувати автомобілем")
else:
    print("Вам заборонено керувати автомобілем!")
