# -----------------------------
# Завдання 4.
# Створіть словник, який зберігає назви продуктів як ключі,
# а їхню ціну як значення. Наприклад: "apple": 12.5
# Додайте ще два продукти.
# Оновіть ціну одного з них.
# Порахуйте загальну суму вартості всіх продуктів.

# Створюємо словник з продуктами і цінами
products = {
    "apple": 12.5,
    "bread": 18.0,
    "milk": 24.3
}

# Оновлюємо ціну одного продукту
products["bread"] = 19.0

# Підраховуємо загальну вартість усіх продуктів
total_price = sum(products.values())

# Виводимо словник і загальну суму
print("Список продуктів:", products)
print("Загальна сума:", total_price)
